Emacs.org
#+PROPERTY: header-args:emacs-lisp :tangle /Users/jeff/.config/emacs/init.el

TODO: Look into using [[https://emacs.stackexchange.com/questions/36727/order-of-blocks-in-org-tangle][this]] to support block reordering, if necessary

A bunch of the content in this file is inspired by/taken from the [[https://systemcrafters.net/emacs-from-scratch/][System Crafters]] site/channel.

This file contains the complete, documented configuration for my Emacs.

The goal of this work is to be able to generate a fixed, known-good configuration for emacs from this file.

* Generated File Warnings
#+begin_src emacs-lisp
  ;;
  ;; DO NOT EDIT!
  ;;
  ;; This file was auto-generated from Emacs.org
  ;; Please edit that file and tangle it to generate both init.el and early-init.el
  ;;
#+end_src

#+begin_src emacs-lisp :tangle /Users/jeff/.config/emacs/early-init.el
  ;;
  ;; DO NOT EDIT!
  ;;
  ;; This file was auto-generated from Emacs.org
  ;; Please edit that file and tangle it to generate both init.el and early-init.el
  ;;
#+end_src
* Configuration Variables

#+begin_src emacs-lisp
  (defvar jpalmer/default-font "Jetbrains Mono")
  (defvar jpalmer/variable-font "Fira Sans")
  (defvar jpalmer/default-font-size 120)
  (defvar jpalmer/default-variable-font-size 150)
#+end_src

* User Information
#+begin_src emacs-lisp
  (setq user-full-name "Jeffrey Palmer"
        user-mail-address "jeffrey.palmer@acm.org")
#+end_src

* Startup Performance
Make startup faster by reducing the frequency of garbage collection
and then use a hook to measure and report startup time.

#+begin_src emacs-lisp
  ;; The default is 800 kb. Measured in bytes
  (setq gc-cons-threshold (* 50 1024 1024))

  ;; Profile emacs startup
  (add-hook 'emacs-startup-hook
            (lambda ()
              (message "*** Emacs loaded in %s with %d garbage collections."
                       (format "%.2f seconds"
                               (float-time (time-subtract after-init-time before-init-time)))
                       gcs-done)))

#+end_src

* Package Management
** package
First of all we need to ensure that package isn't loaded at startup.

#+begin_src emacs-lisp :tangle /Users/jeff/.config/emacs/early-init.el
  (setq package-enable-at-startup nil)
#+end_src

** straight.el
Now straight.el needs to be bootstrapped. This bootstrapping code is provided directly by the [[https://github.com/radian-software/straight.el][straight.el]] project.

#+begin_src emacs-lisp
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name
          "straight/repos/straight.el/bootstrap.el"
          (or (bound-and-true-p straight-base-dir)
              user-emacs-directory)))
        (bootstrap-version 7))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  ;; Set up use-package/straight integration
  (straight-use-package '(use-package :type built-in))
  (setq straight-use-package-by-default t)


  ;; Load the helper package for commands like `straight-x-clean-unused-repos`
  ;; I don't think that I need this anymore, actually
  ;; (require 'straight-x)
#+end_src

* Native Compilation

#+begin_src emacs-lisp
  ;; Silence native code compiler warnings, as they're pretty chatty
  (setq comp-async-report-warnings-errors nil
        ;; This was generated when I asked emacs to disable the display of these compilation errors
        warning-suppress-types '((comp) (comp)))
#+end_src

This is disabled for now while I investigate the native compilation issues I'm seeing.
#+begin_src emacs-lisp :tangle /Users/jeff/.config/emacs/early-init.el
  ;; Set the directory to look for native files

  ;; Set the eln-cache dir
  (when (fboundp 'startup-redirect-eln-cache)
    (startup-redirect-eln-cache
     (convert-standard-filename
      (expand-file-name "var/eln-cache/" user-emacs-directory))))
#+end_src

* Keep runtime files out of .emacs.d

#+begin_src emacs-lisp
  ;; Use no-littering to automatically set common paths to the new user-emacs-directory
  (use-package no-littering
    :config
    (no-littering-theme-backups))

  ;; Keep customization settings in a temporary file
  (setq custom-file
        (if (boundp 'server-socket-dir)
            (expand-file-name "custom.el" server-socket-dir)
          (expand-file-name (format "emacs-custom-%s.el" (user-uid)) temporary-file-directory)))
  ;; For debugging purposes only
  ;; (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  (load custom-file t)

#+end_src

* Allow periodic tasks to run during the day
This allows things like buffer cleanup to happen during the day instead of at midnight, when the computer is not typically on.
#+begin_src emacs-lisp
  (use-package midnight
    :config
    (midnight-delay-set 'midnight-delay "10:00am"))
#+end_src

* Auto-Reverting
#+begin_src emacs-lisp
  ;; Revert Dired and other buffers
  (setq global-auto-revert-non-file-buffers t)

  ;; Revert buffers when the underlying file has changed
  (global-auto-revert-mode 1)
#+end_src
* Server Mode
#+begin_src emacs-lisp
(server-start)
#+end_src
* Basic UI Configuration
** Generic Settings
#+begin_src emacs-lisp

  (scroll-bar-mode -1)                    ; Disable the visible scrollbar
  (tool-bar-mode -1)                      ; Disable the toolbar
  (tooltip-mode -1)                       ; Disable tooltips
  (set-fringe-mode 10)                    ; Give some breathing room
  (menu-bar-mode -1)                      ; Disable the menu bar

  (column-number-mode)

  (setq-default indent-tabs-mode nil
                tab-width 4)

  (setq inhibit-startup-message t
        visible-bell t
        fill-column 80
        kill-whole-line t
        require-final-newline t)

  ;; Don't make me type, I know what I'm doing
  (defalias 'yes-or-no-p 'y-or-n-p)

  ;; Name the frame
  ; (set-frame-parameter nil 'name "Main")

#+end_src

** Font Configuration
#+begin_src emacs-lisp
  ;; Set the default face
  (set-face-attribute 'default nil :font jpalmer/default-font :height jpalmer/default-font-size :weight 'light)

  ;; Set the fixed pitch face
  (set-face-attribute 'fixed-pitch nil :font jpalmer/default-font :height jpalmer/default-font-size :weight 'light)

  ;; Set the variable pitch face
  (set-face-attribute 'variable-pitch nil :font jpalmer/variable-font :height jpalmer/default-variable-font-size :weight 'light)

  ;; Customize the global cursor color
  (set-face-attribute 'cursor nil :background "goldenrod")

  ;; Enable ligatures in emacs-mac
  (mac-auto-operator-composition-mode)

#+end_src

** Theming
*** Doom Themes
Install the doom themes
#+begin_src emacs-lisp
  (use-package doom-themes
    :config
    (setq doom-themes-enable-bold nil
          doom-themes-enable-italic t
          doom-themes-padded-modeline t) ; Adds a 4 pixel margin around the modeline
    (load-theme 'doom-dark+ t)
    (doom-themes-visual-bell-config)
    (doom-themes-neotree-config)
    (doom-themes-org-config))
#+end_src

I'm currently testing out some other options, but my previous go-to theme was "doom-tomorrow-night".
*** Modus Themes (DISABLED)
Try out the Modus themes.

This configuration is for the built-in version of the modus themes:
#+begin_src emacs-lisp :tangle no
  (use-package emacs
    :config
    (require-theme 'modus-themes)
    ;; Include any customization here
    (setq modus-themes-disable-other-themes t
          modus-themes-mode-line '(accented borderless (padding 4) (height 0.9))
          modus-themes-bold-constructs nil
          modus-themes-italic-constructs t
          modus-themes-fringes 'subtle
          ; modus-themes-tabs-accented t
          modus-themes-paren-match '(bold intense)
          modus-themes-prompts '(bold)
          ; modus-themes-completions 'opinionated
          modus-themes-mixed-fonts t
          modus-themes-variable-pitch-ui t
          modus-themes-org-blocks 'gray-background
          modus-themes-syntax '(faint)
          modus-themes-scale-headings t
          modus-themes-region '(bg-only)
          modus-themes-hl-line '(accented)
          modus-themes-headings
          '((1 . (regular 1.2))
            (2 . (regular 1.1))
            (3 . (regular 1.1))
            (t . (light 1.1)))
          modus-themes-org-agenda
          '((header-block . (variable-pitch 1.2 semibold))
            (header-date . (grayscale workaholic bold-today 1.1))
            (event . (accented italic varied))
            (scheduled . uniform)
            (habit . traffic-light))
          )

    (load-theme 'modus-vivendi t))
#+end_src

** Allow highlighting while idle
#+begin_src emacs-lisp
  (use-package idle-highlight-mode
    :diminish idle-highlight-mode
    :config (setq idle-highlight-idle-time 0.5)
    :hook ((prog-mode text-mode) . idle-highlight-mode))
#+end_src

** Modeline Improvements
NOTE: The first time this configuration is loaded, the mode line icons will need to be installed via =M-x all-the-icons-install-fonts=.
#+begin_src emacs-lisp
  (use-package all-the-icons)

  (use-package doom-modeline
    :init (doom-modeline-mode 1)
    :custom ((doom-modeline-buffer-encoding nil)
             (doom-modeline-buffer-file-name-style 'relative-from-project)
             (doom-modeline-height 15)))
#+end_src

* Highlight Current Line
#+begin_src emacs-lisp
  (use-package hl-line
    :config
    (global-hl-line-mode +1))
#+end_src

* Key Bindings
