Emacs.org
** Ivy-Based Completion (DISABLED)
All of these configurations are to support [[https://github.com/abo-abo/swiper][swiper/ivy]]-based completion and associated functionality.
#+begin_src emacs-lisp :tangle no

  (use-package ivy-posframe
    :config
    (setq  ivy-posframe-parameters '((left-fringe . 8) (right-fringe . 8))
          ivy-posframe-display-functions-alist
          '((swiper          . nil)
            (complete-symbol . ivy-posframe-display-at-point)
            ;;(counsel-M-x     . ivy-posframe-display-at-frame-bottom-left)
            (t               . ivy-posframe-display-at-frame-center)))
    (ivy-posframe-mode 1))

  ;; Ivy/Counsel/Swiper Configuration
  (use-package ivy
    :diminish ivy-mode
    :bind
    (:map ivy-mode-map ("C-'" . ivy-avy))
    :config
    (setq projectile-completion-system 'ivy
          ivy-use-virtual-buffers t
          ivy-height 13
          ivy-display-style 'fancy
          ivy-initial-inputs-alist nil
          ivy-count-format "%d/%d "
          ivy-virtual-abbreviate 'full ;; show the full virtual file paths
          ivy-extra-directories '("./")
          ivy-wrap t
          ivy-re-builders-alist '((counsel-M-x . ivy--regex-fuzzy)
                                  (t . ivy--regex-plus)))
    (ivy-mode 1))

  (use-package ivy-rich
    :after (ivy counsel)
    :config
    (setq ivy-rich-path-style 'abbrev)
    (setcdr (assq t ivy-format-functions-alist) #'ivy-format-function-line)
    (ivy-rich-mode 1))

  (use-package counsel-projectile
    :after (projectile counsel)
    :config
    (counsel-projectile-mode))

  (use-package counsel
    :after ivy
    :bind*
    (("M-x" . counsel-M-x)
     ("C-c d d" . counsel-descbinds)
     ("C-c s s" . counsel-ag)
     ("C-c s d" . counsel-ag-projectile)
     ("C-x C-f" . counsel-find-file)
     ("C-x r f" . counsel-recentf)
     ("C-c g g" . counsel-git)
     ("C-c g G" . counsel-git-grep)
     ("C-x l" . counsel-locate)
     ("C-c g s" . counsel-grep-or-swiper)
     ("C-M-y" . counsel-yank-pop)
     ("C-c C-r" . ivy-resume)
     ("C-c i m" . counsel-imenu)
     ("C-c i M" . ivy-imenu-anywhere)
     ("C-c d s" . describe-symbol)
     ("C-c o" . counsel-org-agenda-headlines)
     :map ivy-minibuffer-map
     ("M-y" . ivy-next-line-and-call))
    :config
    (progn
      (defun reloading (cmd)
        (lambda (x)
          (funcall cmd x)
          (ivy--reset-state ivy-last)))
      (defun given-file (cmd prompt)      ; needs lexical-binding
        (lambda (source)
          (let ((target
                 (let ((enable-recursive-minibuffers t))
                   (read-file-name
                    (format "%s %s to:" prompt source)))))
            (funcall cmd source target 1))))
      (defun confirm-delete-file (x)
        (dired-delete-file x 'confirm-each-subdirectory))

      (ivy-add-actions
       'counsel-find-file
       `(("c" ,(given-file #'copy-file "Copy") "copy")
         ("d" ,(reloading #'confirm-delete-file) "delete")
         ("m" ,(reloading (given-file #'rename-file "Move")) "move")))

      (ivy-add-actions
       'counsel-projectile-find-file
       `(("c" ,(given-file #'copy-file "Copy") "copy")
         ("d" ,(reloading #'confirm-delete-file) "delete")
         ("m" ,(reloading (given-file #'rename-file "Move")) "move")
         ("b" counsel-find-file-cd-bookmark-action "cd bookmark")))

      ;; to make counsel-ag search the root projectile directory.
      (defun counsel-ag-projectile ()
        (interactive)
        (counsel-ag nil (projectile-project-root)))

      (setq counsel-find-file-at-point t)

      ;; ignore . files or temporary files
      (setq counsel-find-file-ignore-regexp
            (concat
             ;; File names beginning with # or .
             "\\(?:\\`[#.]\\)"
             ;; File names ending with # or ~
             "\\|\\(?:\\`.+?[#~]\\'\\)"))))

  (use-package swiper
    :bind ("C-s" . swiper))

  ;; further customization of ivy and company
  (use-package prescient
    :after (ivy company)
    :config
    (prescient-persist-mode))

  (use-package ivy-prescient
    :after prescient
    :config
    (ivy-prescient-mode))

  (use-package company-prescient
    :after prescient
    :config
    (company-prescient-mode))

#+end_src
** Company (in-buffer completion - DISABLED)
#+begin_src emacs-lisp :tangle no
  (use-package company
    :diminish company-mode
    :config (global-company-mode))

  (use-package company-posframe
    :config
    (company-posframe-mode 1))
#+end_src

* Window Management
** Window layout management via perspective.el
This seems like it might work nicely with projectile mode? Let's try it out.
#+begin_src emacs-lisp
  (use-package perspective
    :custom
    (persp-mode-prefix-key (kbd "C-c w"))
    (persp-state-default-file (locate-user-emacs-file "var/.emacs.desktop"))
    :bind
    (("C-x k" . persp-kill-buffer*)
     ("C-x C-b" . persp-list-buffers))
    :hook (kill-emacs . persp-state-save)
    :init
    (persp-mode))

  ;; Customize consult to support perspective buffer restrictions
  (with-eval-after-load 'consult
    (consult-customize consult--source-buffer :hidden t :default nil)
    (add-to-list 'consult-buffer-sources persp-consult-source))

  ;; Also add support for creating new perspectives in projectile
  (use-package persp-projectile
    :straight (:host github :repo "bbatsov/persp-projectile")
    :after (projectile perspective)
    :bind
    (:map projectile-command-map ("p" . projectile-persp-switch-project)))
#+end_src

** Window layout management via Eyebrowse
#+begin_src emacs-lisp :tangle no
  (use-package eyebrowse
    :init
    (setq eyebrowse-keymap-prefix (kbd "C-c w"))
    :config
    (setq eyebrowse-mode-line-separator " "
          eyebrowse-new-workspace t)
    (eyebrowse-mode t))

  ;; save the eyebrowse layout periodically
  ;; (use-package eyebrowse-restore
  ;;   :straight (eyebrowse-restore :type git :host github :repo "FrostyX/eyebrowse-restore")
  ;;   :config (eyebrowse-restore-mode))

  (use-package desktop
    :config (desktop-save-mode +1))

#+end_src
** Window Layout Undo/Redo via Winner Mode
Winner mode allows you to easily undo/redo window configuration changes by pressing <C-c left> or <C-c right>
#+begin_src emacs-lisp
  (winner-mode 1)
#+end_src

** Window Navigation
Support directional and letter-based buffer navigation
#+begin_src emacs-lisp
  ;; This allows window navigation by pressing <Shift+Direction>
  (windmove-default-keybindings)
  (use-package ace-window
    :bind
    (("M-o" . ace-window))
    :config
    (setq aw-keys '(?a ?r ?s ?t ?n ?e ?i ?o)
          aw-ignore-current t))
#+end_src

** Control buffer placement
#+begin_src emacs-lisp
  (setq display-buffer-base-action
      '(display-buffer-reuse-mode-window
        display-buffer-reuse-window
        display-buffer-same-window))
  ;; If a popup does happen, don't resize windows to be equally sized
  (setq even-window-sizes nil)
#+end_src

* General Editing
** Hungry Delete
This deletes all whitespace up to the last non-whitespace character when editing. It can be very handy.
#+begin_src emacs-lisp
  ;; Disabled for now in favor of the not-so-smart hungry delete
  (use-package smart-hungry-delete
    :disabled
    :bind (([remap backward-delete-char-untabify] . smart-hungry-delete-backward-char)
           ([remap delete-backward-char] . smart-hungry-delete-backward-char)
           ([remap delete-char] . smart-hungry-delete-forward-char))
    :init (smart-hungry-delete-add-default-hooks))

  (use-package hungry-delete
    :init
    ;; This will leave a space between the previous text and the following text
    ;; (setq hungry-delete-join-reluctantly t)
    :config
    (global-hungry-delete-mode))
#+end_src
** Whitespace Highlighting
This highlights any odd whitespace in a buffer.
#+begin_src emacs-lisp
  (use-package whitespace
    :config
    (setq whitespace-style '(face trailing newline))
    ;; This should probably be enabled everywhere?
    (global-whitespace-mode))
#+end_src
** Enabling per-file location saving
#+begin_src emacs-lisp
  (save-place-mode 1)
#+end_src
* Programming
** General Quality of Life Items
*** Comment line keybind
#+begin_src emacs-lisp
(define-key prog-mode-map (kbd "s-/") 'comment-line)
#+end_src

*** Move lines up or down easily
#+begin_src emacs-lisp
  (use-package move-text
    :config
    (move-text-default-bindings))
#+end_src
*** Set PATH from shell
For some reason emacs doesn't normally start with the PATH from the shell on MacOS. This corrects that behavior so it's easier to run installed programs.
#+begin_src emacs-lisp
  (use-package exec-path-from-shell
    :config
    ; (setq exec-path-from-shell-arguments nil)
    (when (memq window-system '(mac ns))
      (exec-path-from-shell-initialize)))
#+end_src

*** Keychain support
This is required to ensure that SSH interaction with GitHub (for example) is seamless.
#+begin_src emacs-lisp :tangle no
  (use-package keychain-environment
    :config
    (keychain-refresh-environment))
#+end_src

*** [[https://github.com/leoliu/easy-kill][Easy Kill]] - Kill and Mark Things Easily
#+begin_src emacs-lisp
  (use-package easy-kill
    :config
    (global-set-key [remap kill-ring-save] #'easy-kill)
    (global-set-key [remap mark-sexp] #'easy-mark))
#+end_src

*** Paren Handling
**** Always insert matching pairs
#+begin_src emacs-lisp
  ;; Enable global electric-pair mode
  (use-package emacs
   :custom
   (electric-pair-preserve-balance nil)
   :config
   (electric-pair-mode))
#+end_src
**** Highlight Parentheses
#+begin_src emacs-lisp
  ; (use-package highlight-parentheses)
  ;; Try this other option for now
  (use-package paren
    :config
    (set-face-attribute 'show-paren-match-expression nil :background "#363e4a")
    (show-paren-mode 1))
#+end_src
**** Paredit for lisp languages
#+begin_src emacs-lisp
  (use-package paredit
    :diminish paredit-mode
    :hook
    ((clojure-mode cider-repl-mode emacs-lisp-mode lisp-mode lisp-interaction-mode) . enable-paredit-mode))
#+end_src
*** Highlight indentation levels
Show an indicator for the start of an indentation scope.
#+begin_src emacs-lisp
  (use-package highlight-indent-guides
    :custom
    (highlight-indent-guides-auto-character-face-perc 30)
    :config (setq highlight-indent-guides-method 'bitmap)
    :hook (prog-mode . highlight-indent-guides-mode))
#+end_src
*** Enable sub-word mode

This allows easy navigation through camelCaseWords.
#+begin_src emacs-lisp
  (global-subword-mode 1)
#+end_src

*** Highlight FIXME, TODO, etc.
I used to use fic-mode but I'm now using hl-todo.
#+begin_src emacs-lisp :tangle no
  (use-package fic-mode
    :disabled
    :diminish fic-mode
    :hook prog-mode)
#+end_src

Try using =hl-todo= one more time.
#+begin_src emacs-lisp
  (use-package hl-todo
    ;; (global-hl-todo-mode +1)
    ;; Only enable hl-todo-mode for programming buffers
    :hook (prog-mode . hl-todo-mode))

  ;; Also add consult-todo for nav support with consult
  (use-package consult-todo
    :after consult
    :bind ("M-g t" . consult-todo))
#+end_src

*** Project Support
#+begin_src emacs-lisp
  (use-package projectile
    :config
    (projectile-mode +1)
    (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
    ;; Not sure yet why I originally had this disabled
    ; :diminish projectile-mode
    )
#+end_src

*** Search with RipGrep
#+begin_src emacs-lisp
  (use-package rg
    :init
    (rg-enable-default-bindings))
#+end_src

*** Highlight color names in buffers
#+begin_src emacs-lisp
  (use-package rainbow-mode
    :hook (org-mode emacs-lisp-mode web-mode typescript-mode js2-mode))
#+end_src

** Version Control
