init.el

(use-package perspective
  :custom
  (persp-mode-prefix-key (kbd "C-c w"))
  (persp-state-default-file (locate-user-emacs-file "var/.emacs.desktop"))
  :bind
  (("C-x k" . persp-kill-buffer*)
   ("C-x C-b" . persp-list-buffers))
  :hook (kill-emacs . persp-state-save)
  :init
  (persp-mode))

;; Customize consult to support perspective buffer restrictions
(with-eval-after-load 'consult
  (consult-customize consult--source-buffer :hidden t :default nil)
  (add-to-list 'consult-buffer-sources persp-consult-source))

;; Also add support for creating new perspectives in projectile
(use-package persp-projectile
  :straight (:host github :repo "bbatsov/persp-projectile")
  :after (projectile perspective)
  :bind
  (:map projectile-command-map ("p" . projectile-persp-switch-project)))

(winner-mode 1)

;; This allows window navigation by pressing <Shift+Direction>
(windmove-default-keybindings)
(use-package ace-window
  :bind
  (("M-o" . ace-window))
  :config
  (setq aw-keys '(?a ?r ?s ?t ?n ?e ?i ?o)
        aw-ignore-current t))

(setq display-buffer-base-action
    '(display-buffer-reuse-mode-window
      display-buffer-reuse-window
      display-buffer-same-window))
;; If a popup does happen, don't resize windows to be equally sized
(setq even-window-sizes nil)

;; Disabled for now in favor of the not-so-smart hungry delete
(use-package smart-hungry-delete
  :disabled
  :bind (([remap backward-delete-char-untabify] . smart-hungry-delete-backward-char)
         ([remap delete-backward-char] . smart-hungry-delete-backward-char)
         ([remap delete-char] . smart-hungry-delete-forward-char))
  :init (smart-hungry-delete-add-default-hooks))

(use-package hungry-delete
  :init
  (setq hungry-delete-join-reluctantly t)
  :config
  (global-hungry-delete-mode))

(use-package whitespace
  :config
  (setq whitespace-style '(face trailing newline))
  ;; This should probably be enabled everywhere?
  (global-whitespace-mode))

(save-place-mode 1)

(define-key prog-mode-map (kbd "s-/") 'comment-line)

(use-package exec-path-from-shell
  :config
  ; (setq exec-path-from-shell-arguments nil)
  (when (memq window-system '(mac ns))
    (exec-path-from-shell-initialize)))

(use-package easy-kill
  :config
  (global-set-key [remap kill-ring-save] #'easy-kill)
  (global-set-key [remap mark-sexp] #'easy-mark))

; (use-package highlight-parentheses)
;; Try this other option for now
(use-package paren
  :config
  (set-face-attribute 'show-paren-match-expression nil :background "#363e4a")
  (show-paren-mode 1))

(use-package highlight-indent-guides
  :config (setq highlight-indent-guides-method 'bitmap)
  :hook (prog-mode . highlight-indent-guides-mode))

(use-package paredit
  :diminish paredit-mode
  :hook
  ((clojure-mode cider-repl-mode emacs-lisp-mode lisp-mode lisp-interaction-mode) . enable-paredit-mode))

(global-subword-mode 1)

(use-package hl-todo
  ;; (global-hl-todo-mode +1)
  ;; Only enable hl-todo-mode for programming buffers
  :hook (prog-mode . hl-todo-mode))

;; Also add consult-todo for nav support with consult
(use-package consult-todo
  :after consult
  :bind ("M-g t" . consult-todo))

(use-package projectile
  :config
  (projectile-mode +1)
  (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
  ;; Not sure yet why I originally had this disabled
  ; :diminish projectile-mode
  )

(use-package rainbow-mode
  :hook (org-mode emacs-lisp-mode web-mode typescript-mode js2-mode))
