Emacs.org
*** Magit
#+begin_src emacs-lisp
  (use-package magit
    :config
    (progn
      (defadvice magit-status (around magit-fullscreen activate)
        (window-configuration-to-register :magit-fullscreen)
        ad-do-it
        (delete-other-windows))
      (defun magit-quit-session ()
        "Restores the previous window configuration and kills the magit buffer"
        (interactive)
        (kill-buffer)
        (jump-to-register :magit-fullscreen))
      (define-key magit-status-mode-map (kbd "q") 'magit-quit-session)))
#+end_src
*** Fringe Indicators
#+begin_src emacs-lisp
  (use-package git-gutter
    :config
    (global-git-gutter-mode t))

  (use-package fringe-helper)

  (use-package git-gutter-fringe
    :after (git-gutter fringe-helper)
    :config
    (setq git-gutter-fr:side 'right-fringe))
#+end_src
** Languages
*** Tree Sitter Language Definitions [disabled]
Use [[https://github.com/renzmann/treesit-auto][treesit-auto]] to manage this stuff for me.

#+begin_src emacs-lisp :tangle no
  (use-package treesit-auto
    :custom
    (treesit-auto-install 'prompt)
    (treesit-auto-langs '(javascript typescript tsx wgsl))
    :config
    (setq wgsl-tsauto-config
          (make-treesit-auto-recipe
           :lang 'wgsl
           :ts-mode 'wgsl-ts-mode
           ;; :remap '(wgsl-mode)
           :url "https://github.com/szebniok/tree-sitter-wgsl"
           :revision "master"
           :source-dir "src"
           :ext "\\.wgsl\\'"))
    (add-to-list 'treesit-auto-recipe-list wgsl-tsauto-config)
    (treesit-auto-add-to-auto-mode-alist 'all)
    (global-treesit-auto-mode))
#+end_src

*** Language Server Support
This configuration is for LSP mode
#+begin_src emacs-lisp
  (use-package lsp-mode
    :after which-key
    :commands lsp lsp-deferred
    :custom
    (lsp-headerline-breadcrumb-enable nil)
    (lsp-completion-provider :none)       ; we use Corfu!
    :init
    (defun jpalmer/lsp-mode-setup-completion ()
      (setf (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
            '(orderless)))
    :hook ((prog-mode . lsp-deferred)
           ;; (web-mode . lsp-deferred)
           (lsp-mode . lsp-enable-which-key-integration)
           (lsp-completion-mode . jpalmer/lsp-mode-setup-completion))
    ; :bind (:map lsp-mode-map ("TAB" . completion-at-point))
    )

  ;; also install lsp-ui
  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :config
    (setq lsp-ui-sideline-enable t
          lsp-ui-flycheck-enable t
          lsp-ui-imenu-enable t
          lsp-ui-sideline-ignore-duplicate t
          lsp-ui-sideline-show-hover nil
          lsp-lens-enable t
          lsp-ui-doc-position 'bottom)
    (lsp-ui-doc-show))
#+end_src
*** Typescript/Javascript

The non-treesitter configuration.
#+begin_src emacs-lisp
  (use-package typescript-mode
    :mode "\\.ts\\'"
    :config
    (setq typescript-indent-level 4))

  ;; (defun jpalmer/set-js-indentation ()
  ;;   (setq js-indent-level 4)
  ;;   (setq-default tab-width 4))

  ;; (use-package js2-mode
  ;;   :mode "\\.jsx?\\'"
  ;;   :config
  ;;   ;; Don't use built-in syntax checking
  ;;   (setq js2-mode-show-strict-warnings nil)
  ;;   (add-hook 'js2-mode-hook #'jpalmer/set-js-indentation)
  ;;   (add-hook 'json-mode-hook #'jpalmer/set-js-indentation))

  ;; (use-package apheleia
  ;;  :config
  ;;  (apheleia-global-mode +1))

  ;; (use-package prettier-js
  ;;   :config
  ;;  (setq prettier-js-show-errors nil))
#+end_src

The treesitter-based configuration [disabled]
#+begin_src emacs-lisp :tangle no
  (use-package typescript-ts-mode
    :custom
    (typescript-ts-mode-indent-offset 2))
#+end_src

*** TODO: Svelte
*** Julia
#+begin_src emacs-lisp
  (use-package lsp-julia
    ;; :after lsp-mode
    :config
    (setq lsp-julia-default-environment "~/.julia/environments/v1.9"))

  (use-package julia-ts-mode
    ;; :after lsp-julia
    :mode "\\.jl$"
    :config
    (add-to-list 'lsp-language-id-configuration '(julia-ts-mode . "julia"))
    (lsp-register-client
     (make-lsp-client :new-connection (lsp-stdio-connection 'lsp-julia--rls-command)
                 :major-modes '(julia-mode ess-julia-mode julia-ts-mode)
                 :server-id 'julia-ls
                 :multi-root t))
    )

  (use-package julia-repl
    :hook (julia-ts-mode . julia-repl-mode))
#+end_src
*** Rust
#+begin_src emacs-lisp
  ;; (use-package rust-mode
  ;;   :init
  ;;  (setq rust-mode-treesitter-derive nil))

  (use-package rustic
    :after rust-mode
    :custom
    (rustic-analyzer-command '("rustup" "run" "stable" "rust-analyzer")))
#+end_src
*** Emacs Lisp [disabled]
#+begin_src emacs-lisp :tangle no
  ;; FIXME: Put this back
  (add-hook 'emacs-lisp-mode-hook #'flycheck-mode)
#+end_src
*** Clojure
#+begin_src emacs-lisp
  ;; Install the base clojure mode
  (use-package clojure-mode)

  ;; Also include CIDER
  (use-package cider)
#+end_src
*** WebGL/GLSL

#+begin_src emacs-lisp
  ;; FIXME: Put this back
  (use-package glsl-mode
    :mode "(\\.\\(glsl\\|vert\\|frag\\|geom\\)\\'")

  ;; Add completion support for glsl
  ;(use-package company-glsl
  ;  :config
  ;  (when (executable-find "glslangValidator")
  ;    (add-to-list 'company-backends 'company-glsl)))

  ;; Add flycheck support for glsl
  (use-package flycheck-glsl
    :after flycheck
    :straight (flycheck-glsl :type git :host github :repo "yrns/flycheck-glsl"
                             :fork (:host github :repo "JeffreyPalmer/flycheck-glsl"))
    :config (flycheck-glsl-setup))

  ;; try another package, as the first one requires some rework
  ;; (use-package flycheck-glsl
  ;;   :after flycheck
  ;;   :straight (flycheck-glsl :type git :host github :repo "Kaali/flycheck-glsl"))

  ;; Using the code directly
  ;; (with-eval-after-load 'flycheck
  ;;   (flycheck-define-checker jpalmer/glsl-lang-validator
  ;;     "A GLSL checker using glslangValidator.
  ;;   See URL https://www.khronos.org/opengles/sdk/tools/Reference-Compiler/"
  ;;     :command ("glslangValidator" source)
  ;;     :error-patterns
  ;;     ((error line-start "ERROR: " column ":" line ": " (message) line-end))
  ;;     :modes glsl-mode)

  ;;   (add-to-list 'flycheck-checkers 'jpalmer/glsl-lang-validator))
#+end_src
*** WGSL
WGSL is the shader language for WebGPU.

This is a tree-sitter-based approach that is currently disabled.
For some reason this attempt at hooking into =treesit-auto= doesn't work. I ended up having to install the WGSL treesitter grammar by hand.

#+begin_src emacs-lisp :tangle no
  (use-package wgsl-ts-mode
    :straight (:host github :repo "acowley/wgsl-ts-mode")
    :mode "\\.wgsl\\'")

#+end_src

Try using a different WGSL mode that doesn't use treesitter.
#+begin_src emacs-lisp
  (use-package wgsl-mode
    :after lsp-mode
    :config
    ;; Register this mode with lsp
    ; (add-to-list 'lsp-language-id-configuration '(wgsl-mode . "wgsl"))
    ;(lsp-register-client
    ; (make-lsp-client :new-connection (lsp-stdio-connection "wgsl_analyzer")
    ;                  :activation-fn (lsp-activate-on "wgsl")
    ;                  :server-id "wgsl-ls"))
    )
#+end_src
*** HTML
#+begin_src emacs-lisp
  (use-package web-mode
    :mode "(\\.\\(html?\\|ejs\\|tsx\\|jsx\\)\\'"
    :hook (web-mode . lsp-deferred)
    :config
    (setq-default web-mode-code-indent-offset 2)
    (setq-default web-mode-markup-indent-offset 2)
    (setq-default web-mode-attribute-indent-offset 2))

  ;; Start the server with `httpd-start`
  ;; Use `impatient-mode` in any buffer
  (use-package impatient-mode)

  (use-package skewer-mode)
#+end_src
** Compilation
Set up the compile package and ensure that compilation output automatically scrolls.
#+begin_src emacs-lisp
  (use-package compile
    :custom
    (compilation-sroll-output t))

  (defun auto-recompile-buffer ()
    (interactive)
    (if (member #'recompile after-save-hook)
        (remove-hook 'after-save-hook #'recompile t)
      (add-hook 'after-save-hook #'recompile nil t)))
#+end_src
** Syntax Checking with flycheck
#+begin_src emacs-lisp
  (use-package flycheck
    :defer t
    :custom
    ; (flycheck-highlighting-mode 'lines)
    ; (flycheck-highlighting-style 'level-face)
    (flycheck-indication-mode 'right-fringe)
    ;; FIXME: This will probably need to be fixed
    ; :hook (lsp-mode glsl-mode)
    :config (global-flycheck-mode))
#+end_src
** Snippets
#+begin_src emacs-lisp
  (use-package yasnippet
    :hook (prog-mode . yas-minor-mode)
    :config (yas-reload-all))
#+end_src
* Text Editing
Enable automatic wrapping of long lines in text modes, only. This makes it easier to edit text files, but leaves code formatting up to the developer.

#+begin_src emacs-lisp
  (add-hook 'text-mode-hook 'turn-on-visual-line-mode)
#+end_src

** Markdown Support
#+begin_src emacs-lisp
  (use-package markdown-mode
    :commands (markdown-mode gfm-mode)
    :mode
    (("README\\.md\\'" . gfm-mode)
     ("\\.md\\'" . markdown-mode)
     ("\\.markdown\\'" . markdown-mode))
    :config
    (setq markdown-fontify-code-blocks-natively t)
    (defun jpalmer/set-markdown-header-font-sizes ()
      (dolist (face '((markdown-header-face-1 . 1.2)
                      (markdown-header-face-2 . 1.1)
                      (markdown-header-face-3 . 1.0)
                      (markdown-header-face-4 . 1.0)
                      (markdown-header-face-5 . 1.0)))
        (set-face-attribute (car face) nil :weight 'normal :height (cdr face))))
    (defun jpalmer/markdown-mode-hook ()
      (jpalmer/set-markdown-header-font-sizes))
    (add-hook 'markdown-mode-hook 'jpalmer/markdown-mode-hook))
#+end_src

* Org Mode
