init.el

(use-package magit
  :config
  (progn
    (defadvice magit-status (around magit-fullscreen activate)
      (window-configuration-to-register :magit-fullscreen)
      ad-do-it
      (delete-other-windows))
    (defun magit-quit-session ()
      "Restores the previous window configuration and kills the magit buffer"
      (interactive)
      (kill-buffer)
      (jump-to-register :magit-fullscreen))
    (define-key magit-status-mode-map (kbd "q") 'magit-quit-session)))

(use-package git-gutter
  :config
  (global-git-gutter-mode t))

(use-package fringe-helper)

(use-package git-gutter-fringe
  :after (git-gutter fringe-helper)
  :config
  (setq git-gutter-fr:side 'right-fringe))

(use-package treesit-auto
  :custom
  (treesit-auto-install 'prompt)
  :config
  (treesit-auto-add-to-auto-mode-alist 'all)
  (global-treesit-auto-mode))

(use-package lsp-mode
  :after which-key
  :commands lsp lsp-deferred
  :init
  (defun jpalmer/lsp-mode-setup-completion ()
    (setf (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
          '(orderless)))
  :hook ( (typescript-ts-mode . lsp-deferred)
          (js2-ts-mode . lsp-deferred)
          (web-mode . lsp-deferred)
          (lsp-mode . lsp-enable-which-key-integration)
          (lsp-completion-mode . jpalmer/lsp-mode-setup-completion))
  ; :bind (:map lsp-mode-map ("TAB" . completion-at-point))
  :custom
  (lsp-headerline-breadcrumb-enable nil)
  (lsp-completion-provider :none)       ; we use Corfu!
  )

;; also install lsp-ui
(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :config
  (setq lsp-ui-sideline-enable t
        lsp-ui-flycheck-enable t
        lsp-ui-imenu-enable t
        lsp-ui-sideline-ignore-duplicate t
        lsp-ui-sideline-show-hover nil
        lsp-ui-doc-position 'bottom)
  (lsp-ui-doc-show))

(use-package typescript-ts-mode
  :custom
  ((typescript-ts-mode-indent-offset 4)))

;; FIXME: Put this back
(use-package glsl-mode
  :mode "(\\.\\(glsl\\|vert\\|frag\\|geom\\)\\'")

;; Add completion support for glsl
;(use-package company-glsl
;  :config
;  (when (executable-find "glslangValidator")
;    (add-to-list 'company-backends 'company-glsl)))

;; Add flycheck support for glsl
(use-package flycheck-glsl
  :after flycheck
  :straight (flycheck-glsl :type git :host github :repo "yrns/flycheck-glsl"
                           :fork (:host github :repo "JeffreyPalmer/flycheck-glsl"))
  :config (flycheck-glsl-setup))

;; try another package, as the first one requires some rework
;; (use-package flycheck-glsl
;;   :after flycheck
;;   :straight (flycheck-glsl :type git :host github :repo "Kaali/flycheck-glsl"))

;; Using the code directly
;; (with-eval-after-load 'flycheck
;;   (flycheck-define-checker jpalmer/glsl-lang-validator
;;     "A GLSL checker using glslangValidator.
;;   See URL https://www.khronos.org/opengles/sdk/tools/Reference-Compiler/"
;;     :command ("glslangValidator" source)
;;     :error-patterns
;;     ((error line-start "ERROR: " column ":" line ": " (message) line-end))
;;     :modes glsl-mode)

;;   (add-to-list 'flycheck-checkers 'jpalmer/glsl-lang-validator))

(use-package web-mode
  :mode "(\\.\\(html?\\|ejs\\|tsx\\|jsx\\)\\'"
  :config
  (setq-default web-mode-code-indent-offset 2)
  (setq-default web-mode-markup-indent-offset 2)
  (setq-default web-mode-attribute-indent-offset 2))

;; Start the server with `httpd-start`
;; Use `impatient-mode` in any buffer
(use-package impatient-mode)

(use-package skewer-mode)

(use-package compile
  :custom
  (compilation-sroll-output t))

(defun auto-recompile-buffer ()
  (interactive)
  (if (member #'recompile after-save-hook)
      (remove-hook 'after-save-hook #'recompile t)
    (add-hook 'after-save-hook #'recompile nil t)))

(use-package flycheck
  :defer t
  :custom
  ; (flycheck-highlighting-mode 'lines)
  ; (flycheck-highlighting-style 'level-face)
  (flycheck-indication-mode 'right-fringe)
  ;; FIXME: This will probably need to be fixed
  ; :hook (lsp-mode glsl-mode)
  :config (global-flycheck-mode))

(use-package yasnippet
  :hook (prog-mode . yas-minor-mode)
  :config (yas-reload-all))

(add-hook 'text-mode-hook 'turn-on-visual-line-mode)

(use-package markdown-mode
  :commands (markdown-mode gfm-mode)
  :mode
  (("README\\.md\\'" . gfm-mode)
   ("\\.md\\'" . markdown-mode)
   ("\\.markdown\\'" . markdown-mode))
  :config
  (setq markdown-fontify-code-blocks-natively t)
  (defun jpalmer/set-markdown-header-font-sizes ()
    (dolist (face '((markdown-header-face-1 . 1.2)
                    (markdown-header-face-2 . 1.1)
                    (markdown-header-face-3 . 1.0)
                    (markdown-header-face-4 . 1.0)
                    (markdown-header-face-5 . 1.0)))
      (set-face-attribute (car face) nil :weight 'normal :height (cdr face))))
  (defun jpalmer/markdown-mode-hook ()
    (jpalmer/set-markdown-header-font-sizes))
  (add-hook 'markdown-mode-hook 'jpalmer/markdown-mode-hook))

(use-package org
