Emacs.org
** General Org Setup
#+begin_src emacs-lisp
  (use-package org
    ;; :ensure org-contrib
    ;; :pin gnu
    :straight (:type built-in)
    :bind (("C-c l" . org-store-link)
           ("C-c a" . org-agenda)
           ("C-c c" . org-capture)
           ("C-c b" . org-switchb)
           ("<f12>" . org-agenda))
    :hook
    ((org-mode . (lambda () (variable-pitch-mode t)))
     (org-mode . visual-line-mode)
     (org-mode . (lambda ()
                   ;; undefine C-c [ and C-c ]
                   (org-defkey org-mode-map (kbd "C-c [") 'undefined)
                   (org-defkey org-mode-map (kbd "C-c ]") 'undefined)
                   ;; make sure that org-reveal is bound
                   (org-defkey org-mode-map (kbd "C-c r") 'org-reveal))))
    :config
    (setq org-directory "~/Library/Mobile Documents/iCloud~com~appsonthemove~beorg/Documents/org"
          org-agenda-files (list org-directory)
          org-agenda-start-day nil
          org-default-notes-file (concat org-directory "/inbox.org")
          org-clock-persist 'history
          org-enforce-todo-dependencies t
          org-fontify-quote-and-verse-blocks t
          org-src-tab-acts-natively t
          org-src-fontify-natively t
          org-hide-emphasis-markers t
          org-hide-leading-stars t
          org-insert-heading-respect-content t
          org-catch-invisible-edits 'show-and-error
          org-use-speed-commands t
          ;; don't reorganize windows when opening the agenda
          org-agenda-window-setup 'current-window
          ;; open org links in the same window
          org-link-frame-setup '((file . find-file))
          ;; calculate completion statistics for multi-level projects
          org-hierarchical-todo-statistics nil
          ;; org-agenda-hide-tags-regexp TODO - figure out what this should be
          ;; don't show scheduled TODO items
          org-agenda-todo-ignore-scheduled 'future
          ;; logging work
          org-log-done 'time
          org-log-into-drawer "LOGBOOK"
          ;; capture settings
          org-capture-templates '(("t" "To Do" entry (file "")
                                   "* TODO %?\n")
                                  ("g" "Generic" entry (file "")
                                   "* %?\n")
                                  ("j" "Journal Entry"
                                   entry (file+olp+datetree "journal.org")
                                   "* %?")
                                  ("l" "A link, for reading later." entry (file "")
                                   "* [[%:link][%:description]]%?"))
          ;; refile settings
          org-refile-targets '((nil :maxlevel . 9)
                               (org-agenda-files :maxlevel . 9))
          org-refile-use-outline-path 'file
          org-outline-path-complete-in-steps nil
          org-refile-allow-creating-parent-nodes 'confirm
          org-log-note-headings '((done        . "CLOSING NOTE %t")
                                  (note        . "Note taken on %t")
                                  (state       . "State %-12s from %-12S %t")
                                  (reschedule  . "Rescheduled from %S on %t")
                                  (delschedule . "Not scheduled, was %S on %t")
                                  (redeadline  . "New deadline from %S on %t")
                                  (deldeadline . "Removed deadline, was %S on %t"))
          org-startup-indented t
          org-todo-keywords '((sequence "TODO(t)" "NEXT(n)" "TODAY(y)" "IN_PROGRESS(i)" "WAITING(w@/!)" "|" "DONE(d!/!)")
                              (sequence "PROJECT(p)" "ACTIVE(a)" "|" "FINISHED(f!)" "CANCELLED(c@)")
                              (sequence "SOMEDAY(S!)" "MAYBE(m!)"))
          org-todo-keyword-faces '(("TODO" :foreground "DodgerBlue3")
                                   ("NEXT" :foreground "DodgerBlue2")
                                   ("TODAY" :foreground "SpringGreen2")
                                   ("IN_PROGRESS" :foreground "SpringGreen2")
                                   ("DONE" :foreground "forest green")
                                   ("PROJECT" :foreground "cornflower blue")
                                   ("ACTIVE" :foreground "deep sky blue")
                                   ("FINISHED" :foreground "forest green")
                                   ("CANCELLED" :foreground "goldenrod")
                                   ("WAITING" :foreground "coral")
                                   ("SOMEDAY" :foreground "purple")
                                   ("MAYBE" :foreground "purple"))
          org-todo-state-tags-triggers '(("PROJECT" ("project" . t) ("active" . nil))
                                         ("" ("project" . nil) ("active" . nil))
                                         ("ACTIVE" ("active" . t))
                                         ("FINISHED" ("active" . nil))
                                         ("SOMEDAY" ("active" . nil))
                                         ("MAYBE" ("active" . nil)))
          ;; agenda customization
          org-agenda-span 'day
          org-stuck-projects '("/PROJECT|ACTIVE" ("NEXT" "TODAY") nil "")
          org-agenda-compact-blocks nil
          org-agenda-block-separator ?\-
          org-agenda-dim-blocked-tasks nil
          org-agenda-custom-commands
          '(
            ;; a view that supports:
            ;; - most important task of the day
            ;; - secondary tasks
            ;; - other tasks if i have time
            ("d" "Daily View"
             ((agenda "" nil)
              (todo "WAITING"
                    ((org-agenda-overriding-header "Waiting")))
              (tags-todo "/TODAY|IN_PROGRESS"
                         ((org-agenda-overriding-header "Most Important Tasks for Today")))
              (todo "ACTIVE"
                    ((org-agenda-overriding-header "Active Projects")))
              (tags-todo "active/NEXT"
                         ((org-agenda-overriding-header "Active Project Next Tasks")
                          (org-agenda-sorting-strategy '(todo-state-down category-keep))))
              (tags "REFILE"
                    ((org-agenda-overriding-header "Inbox")
                     (org-tags-match-list-sublevels nil)))
              (tags-todo "-active+project/NEXT"
                         ((org-agenda-overriding-header "Other Project Next Tasks")
                          (org-agenda-sorting-strategy '(todo-state-down category-keep))))
              (tags-todo "+active/TODO"
                         ((org-agenda-overriding-header "Active Project Tasks")
                          (org-agenda-sorting-strategy '(todo-state-down category-keep))))))
            ("D" "Review completed tasks"
             ((tags-todo "/DONE"
                         ((org-agenda-overriding-header "Completed Tasks and Projects")))))
            ("n" "Non-Project Tasks"
             ((tags-todo "-project-active/!TODO|NEXT|TODAY"
                         ((org-agenda-overriding-header "Non-Project Tasks")))))
            ("p" "Project Review"
             ((tags-todo "/PROJECT|ACTIVE"
                         ((org-agenda-overriding-header "Stuck Projects")
                          (org-agenda-skip-function '(org-agenda-skip-subtree-if 'todo '("NEXT" "TODAY")))))
              (tags-todo "/ACTIVE"
                         ((org-agenda-overriding-header "Active Projects")
                          (org-agenda-skip-function '(org-agenda-skip-subtree-if 'nottodo '("NEXT" "TODAY")))))
              (tags-todo "/PROJECT"
                         ((org-agenda-overriding-header "Other Projects")
                          (org-agenda-skip-function '(org-agenda-skip-subtree-if 'nottodo '("NEXT" "TODAY")))))
              (tags-todo "-CANCELLED/"
                         ((org-agenda-overriding-header "Reviews Scheduled")
                          (org-agenda-skip-function 'org-review-agenda-skip)
                          (org-agenda-cmp-user-defined 'org-review-compare)
                          (org-agenda-sorting-strategy '(user-defined-down))))))
            ("h" "Habits" tags-todo "STYLE=\"habit\""
             ((org-agenda-overriding-header "Habits")
              (org-agenda-sorting-strategy
               '(todo-state-down effort-up category-keep))))
            ("i" "Inbox" tags "REFILE"
             ((org-agenda-overriding-header "Inbox")
              (org-tags-match-list-sublevels nil)))))
    (org-clock-persistence-insinuate))
#+end_src

