Emacs.org
** Better Fonts
*** Improved bullet formatting
#+begin_src emacs-lisp
  (use-package org-superstar
    :after org
    :hook (org-mode . org-superstar-mode)
    :custom
    (org-superstar-remove-leading-stars t)
    (org-superstar-headline-bullets-list '("" "" "" "" "" "" "")))
#+end_src

*** Font Adjustments
#+begin_src emacs-lisp
  (with-eval-after-load 'org-faces
    ;; Increase the size of various headings
    (set-face-attribute 'org-document-title nil :font jpalmer/variable-font :weight 'light :height 1.3)
    (dolist (face '((org-level-1 . 1.25)
                    (org-level-2 . 1.2)
                    (org-level-3 . 1.15)
                    (org-level-4 . 1.1)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil :font jpalmer/variable-font :weight 'light :height (cdr face)))

    ;; Make sure org-indent face is available
    (require 'org-indent)

    ;; Ensure that anything that should be fixed-pitch in Org files appears that way
    (set-face-attribute 'org-block nil :foreground 'unspecified :inherit 'fixed-pitch)
    (set-face-attribute 'org-table nil  :inherit 'fixed-pitch)
    (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
    ; (set-face-attribute 'org-link nil   :weight 'regular :inherit 'variable-pitch)
    (set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

    ;; Get rid of the background on column views
    (set-face-attribute 'org-column nil :background 'unspecified)
    (set-face-attribute 'org-column-title nil :background 'unspecified))
#+end_src

** Fixup agenda display of empty sections
#+begin_src emacs-lisp
  (defun jpalmer/org-agenda-delete-empty-blocks ()
    "Remove empty agenda blocks.
     A block is identified as empty if there are fewer than 2
     non-empty lines in the block (excluding the line with
     `org-agenda-block-separator' characters)."
    (when org-agenda-compact-blocks
      (user-error "Cannot delete empty compact blocks"))
    (setq buffer-read-only nil)
    (save-excursion
      (goto-char (point-min))
      (let* ((blank-line-re "^\\s-*$")
             (content-line-count (if (looking-at-p blank-line-re) 0 1))
             (start-pos (point))
             (block-re (format "%c\\{10,\\}" org-agenda-block-separator)))
        (while (and (not (eobp)) (forward-line))
          (cond
           ((looking-at-p block-re)
            (when (< content-line-count 2)
              (delete-region start-pos (1+ (point-at-bol))))
            (setq start-pos (point))
            (forward-line)
            (setq content-line-count (if (looking-at-p blank-line-re) 0 1)))
           ((not (looking-at-p blank-line-re))
            (setq content-line-count (1+ content-line-count)))))
        (when (< content-line-count 2)
          (delete-region start-pos (point-max)))
        (goto-char (point-min))
        ;; The above strategy can leave a separator line at the beginning
        ;; of the buffer.
        (when (looking-at-p block-re)
          (delete-region (point) (1+ (point-at-eol))))))
    (setq buffer-read-only t))
(add-hook 'org-agenda-finalize-hook #'jpalmer/org-agenda-delete-empty-blocks)

#+end_src

** Org Roam

#+begin_src emacs-lisp
  (use-package org-roam
    :ensure t
    :init
    (setq org-roam-v2-ack t)
    :custom
    (org-roam-directory "~/Documents/OrgRoam")
    (org-roam-completion-everywhere t)
    :bind (("C-c n l" . org-roam-buffer-toggle)
           ("C-c n f" . org-roam-node-find)
           ("C-c n i" . org-roam-node-insert)
           ("C-c n r" . org-roam-refile)
           :map org-mode-map
           ("C-M-i" . completion-at-point)
           :map org-roam-dailies-map
           ("Y" . org-roam-dailies-capture-yesterday)
           ("T" . org-roam-dailies-capture-tomorrow))
    :bind-keymap
    ("C-c n d" . org-roam-dailies-map)
    :config
    (require 'org-roam-dailies)
    (org-roam-db-autosync-mode))
#+end_src

** Other org miscellany
*** Enable smart checklist updating (via org-contrib/org-checklist)
#+begin_src emacs-lisp
  ;; Install any required org-contrib libraries
  (use-package org-contrib
    :config
    (require 'org-checklist))
#+end_src
*** Add support for project review via org-review
#+begin_src emacs-lisp
  (use-package org-review
    :bind
    (("C-c v" . org-review-insert-last-review)))
#+end_src
***  Also enable Pomodoro time tracking
#+begin_src emacs-lisp
  ;; FIXME: This is disabled for now
  ;; Add support for pomodoro time tracking
  (use-package org-pomodoro
    :bind
    ("s-p" . org-pomodoro)
    :config
    (setq alert-user-configuration '((((:category . "org-pomodoro")) osx-notifier nil))
          org-pomodoro-format "~%s"))
#+end_src
*** Tempo Mode for Structure Templates
#+begin_src emacs-lisp

  ;; TODO: Enable this once org mode is fully set up
  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))

#+end_src

** Auto-Tangle Configuration Files

#+begin_src emacs-lisp
  (defun jpalmer/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "./Emacs.org"))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))
  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'jpalmer/org-babel-tangle-config)))
#+end_src

** Org-QL
[[https://github.com/alphapapa/org-ql][org-ql]] is a package that provides a query language for org files, as well as some advanced search capabilities.
#+begin_src emacs-lisp
  (use-package org-ql
    :straight (:host github
               :repo "alphapapa/org-ql"
               :files (:defaults (:exclude "helm-org-ql.el")))
    :bind ("M-g o" . org-ql-find-in-agenda))

  ;; Now add support for org-file searching using org-ql-find into consult
#+end_src

* Tree Navigation
Set up a tree-based navigation system, just in case.
#+begin_src emacs-lisp
  (use-package neotree
    :bind ("<f8>" . neotree-project-dir)
    :hook
    (neotree-mode . (lambda ()
                      (variable-pitch-mode t)))
    :config
    (setq neo-smart-open t
          projectile-switch-project-action 'neotree-projectile-action
          neo-theme 'icons
          neo-window-width 35)
    (defun neotree-project-dir ()
      "Open NeoTree using the git root."
      (interactive)
      (let ((project-dir (projectile-project-root))
            (file-name (buffer-file-name)))
        (neotree-toggle)
        (if project-dir
            (if (neo-global--window-exists-p)
                (progn
                  (neotree-dir project-dir)
                  (neotree-find file-name)))
          (message "Could not find git project root.")))))
#+end_src

* LLM Support
This enables the =gptel= package, which is used to allow emacs to interact with LLM servers.
#+begin_src emacs-lisp
  (use-package gptel
   :custom
   (gptel-backend (gptel-make-openai "koboldcpp"
                      :stream t
                      :protocol "http"
                      :host "10.0.1.192:5000"
                      :models '("mixtral-instruct")))
   (gptel-default-mode 'org-mode)
   (gptel-model "mixtral-instruct")
   )
#+end_src
* Wrap-Up Configuration

Reset garbage collection to a reasonable default.
#+begin_src emacs-lisp
  (setq gc-cons-threshold (* 2 1024 1024))
#+end_src
